IDEA StatiCa Open Model
PointOnLine3D.IsRelative Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets absolute or relative representation of the position value.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool IsRelative { get; set; }
Public Property IsRelative As Boolean
	Get
	Set
public:
property bool IsRelative {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
PointOnLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace